output/cora-released-art.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.cora-released-art.com (be patient)


Server Software:        Apache
Server Hostname:        www.cora-released-art.com
Server Port:            80

Document Path:          /
Document Length:        13195 bytes

Concurrency Level:      100
Time taken for tests:   34.254 seconds
Complete requests:      500
Failed requests:        340
   (Connect: 0, Receive: 0, Length: 340, Exceptions: 0)
Non-2xx responses:      340
Total transferred:      2250080 bytes
HTML transferred:       2139080 bytes
Requests per second:    14.60 [#/sec] (mean)
Time per request:       6850.855 [ms] (mean)
Time per request:       68.509 [ms] (mean, across all concurrent requests)
Transfer rate:          64.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       29  948 1166.9    162    5248
Processing:   134 5732 4611.6   4737   18564
Waiting:      134 5550 4486.3   4713   18564
Total:        798 6680 4969.5   5162   18718

Percentage of the requests served within a certain time (ms)
  50%   5162
  66%   9066
  75%  10475
  80%  10488
  90%  13907
  95%  18342
  98%  18596
  99%  18699
 100%  18718 (longest request)