output/departures-international.com.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.departures-international.com (be patient)


Server Software:        nginx/1.6.2
Server Hostname:        www.departures-international.com
Server Port:            80

Document Path:          /home.html
Document Length:        48452 bytes

Concurrency Level:      100
Time taken for tests:   17.464 seconds
Complete requests:      500
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      24051635 bytes
HTML transferred:       23789932 bytes
Requests per second:    28.63 [#/sec] (mean)
Time per request:       3492.704 [ms] (mean)
Time per request:       34.927 [ms] (mean, across all concurrent requests)
Transfer rate:          1344.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21   93 222.7     29    1429
Processing:   249 3081 1087.6   3224    7110
Waiting:        0 2879 1052.2   3127    6141
Total:        369 3174 1153.3   3254    8531

Percentage of the requests served within a certain time (ms)
  50%   3254
  66%   3347
  75%   3406
  80%   3448
  90%   4238
  95%   5391
  98%   6410
  99%   7728
 100%   8531 (longest request)