output/dortmund-ueberrascht-dich.de.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking dortmund-ueberrascht-dich.de (be patient)


Server Software:        Apache
Server Hostname:        dortmund-ueberrascht-dich.de
Server Port:            80

Document Path:          /
Document Length:        117411 bytes

Concurrency Level:      100
Time taken for tests:   110.796 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      58799500 bytes
HTML transferred:       58705500 bytes
Requests per second:    4.51 [#/sec] (mean)
Time per request:       22159.209 [ms] (mean)
Time per request:       221.592 [ms] (mean, across all concurrent requests)
Transfer rate:          518.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       18   99 216.7     28    2152
Processing: 15495 20115 5012.3  18343   37749
Waiting:      330 4722 4832.9   3066   20934
Total:      15523 20213 5074.0  18458   37954

Percentage of the requests served within a certain time (ms)
  50%  18458
  66%  19912
  75%  20975
  80%  21976
  90%  28246
  95%  34387
  98%  35357
  99%  37897
 100%  37954 (longest request)