output/dortmund-ueberrascht-dich.de.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking dortmund-ueberrascht-dich.de (be patient)


Server Software:        Apache
Server Hostname:        dortmund-ueberrascht-dich.de
Server Port:            80

Document Path:          /
Document Length:        117434 bytes

Concurrency Level:      100
Time taken for tests:   134.003 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      58811000 bytes
HTML transferred:       58717000 bytes
Requests per second:    3.73 [#/sec] (mean)
Time per request:       26800.619 [ms] (mean)
Time per request:       268.006 [ms] (mean, across all concurrent requests)
Transfer rate:          428.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       18  123 279.3     27    2077
Processing: 15632 25359 4966.5  25749   44658
Waiting:      353 9352 4748.0   9425   23213
Total:      15664 25481 5061.9  25865   44851

Percentage of the requests served within a certain time (ms)
  50%  25865
  66%  27745
  75%  28968
  80%  29396
  90%  31199
  95%  32497
  98%  34976
  99%  43723
 100%  44851 (longest request)