output/neos.demo.typo3.org.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking neos.demo.typo3.org (be patient)


Server Software:        nginx/1.7.6
Server Hostname:        neos.demo.typo3.org
Server Port:            80

Document Path:          /
Document Length:        7733 bytes

Concurrency Level:      100
Time taken for tests:   7.787 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      3977000 bytes
HTML transferred:       3866500 bytes
Requests per second:    64.21 [#/sec] (mean)
Time per request:       1557.410 [ms] (mean)
Time per request:       15.574 [ms] (mean, across all concurrent requests)
Transfer rate:          498.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       20  292 848.2     28    4629
Processing:   132 1034 416.4   1040    4669
Waiting:      101  983 342.6   1006    2043
Total:        163 1326 969.3   1129    6172

Percentage of the requests served within a certain time (ms)
  50%   1129
  66%   1285
  75%   1392
  80%   1464
  90%   2138
  95%   3246
  98%   4979
  99%   5882
 100%   6172 (longest request)