output/neos.demo.typo3.org.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking neos.demo.typo3.org (be patient)


Server Software:        nginx/1.7.6
Server Hostname:        neos.demo.typo3.org
Server Port:            80

Document Path:          /
Document Length:        7733 bytes

Concurrency Level:      100
Time taken for tests:   8.601 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      3977000 bytes
HTML transferred:       3866500 bytes
Requests per second:    58.14 [#/sec] (mean)
Time per request:       1720.131 [ms] (mean)
Time per request:       17.201 [ms] (mean, across all concurrent requests)
Transfer rate:          451.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       20  387 1124.3     28    5770
Processing:   174  869 378.9    808    2561
Waiting:      143  822 346.3    771    2142
Total:        205 1256 1247.2    862    7746

Percentage of the requests served within a certain time (ms)
  50%    862
  66%   1041
  75%   1281
  80%   1421
  90%   2021
  95%   4105
  98%   5891
  99%   7370
 100%   7746 (longest request)