output/neos.demo.typo3.org.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking neos.demo.typo3.org (be patient).....done


Server Software:        nginx/1.7.6
Server Hostname:        neos.demo.typo3.org
Server Port:            80

Document Path:          /
Document Length:        7733 bytes

Concurrency Level:      100
Time taken for tests:   6.549 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      795400 bytes
HTML transferred:       773300 bytes
Requests per second:    15.27 [#/sec] (mean)
Time per request:       6549.299 [ms] (mean)
Time per request:       65.493 [ms] (mean, across all concurrent requests)
Transfer rate:          118.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       71  106  28.6    102     193
Processing:   170 2366 1630.7   3215    6447
Waiting:      137 2239 1458.7   3185    3660
Total:        252 2472 1629.3   3317    6548

Percentage of the requests served within a certain time (ms)
  50%   3317
  66%   3487
  75%   3720
  80%   3741
  90%   3774
  95%   3793
  98%   6548
  99%   6548
 100%   6548 (longest request)