output/neos.typo3.org.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking neos.typo3.org (be patient)


Server Software:        nginx/1.6.2
Server Hostname:        neos.typo3.org
Server Port:            443
SSL/TLS Protocol:       TLSv1,DHE-RSA-AES256-SHA,2048,256

Document Path:          /
Document Length:        33100 bytes

Concurrency Level:      100
Time taken for tests:   68.410 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      16664500 bytes
HTML transferred:       16550000 bytes
Requests per second:    7.31 [#/sec] (mean)
Time per request:       13682.060 [ms] (mean)
Time per request:       136.821 [ms] (mean, across all concurrent requests)
Transfer rate:          237.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       81  270 354.7    101    1361
Processing:  1106 12121 3178.1  13364   14330
Waiting:      608 12078 3184.3  13323   14265
Total:       1338 12391 3008.5  13475   14412

Percentage of the requests served within a certain time (ms)
  50%  13475
  66%  13654
  75%  13744
  80%  13799
  90%  14033
  95%  14114
  98%  14216
  99%  14285
 100%  14412 (longest request)