output/neos.typo3.org.ab.log
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking neos.typo3.org (be patient)


Server Software:        nginx/1.6.2
Server Hostname:        neos.typo3.org
Server Port:            443
SSL/TLS Protocol:       TLSv1,DHE-RSA-AES256-SHA,2048,256

Document Path:          /
Document Length:        33100 bytes

Concurrency Level:      100
Time taken for tests:   71.439 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      16664500 bytes
HTML transferred:       16550000 bytes
Requests per second:    7.00 [#/sec] (mean)
Time per request:       14287.839 [ms] (mean)
Time per request:       142.878 [ms] (mean, across all concurrent requests)
Transfer rate:          227.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       81  647 1449.1    101    7795
Processing:   589 12363 3427.7  13755   15590
Waiting:      553 12325 3428.9  13713   15565
Total:        962 13010 3361.7  13953   21715

Percentage of the requests served within a certain time (ms)
  50%  13953
  66%  14267
  75%  14536
  80%  14736
  90%  15188
  95%  15440
  98%  18125
  99%  19451
 100%  21715 (longest request)